Revit 2024 API
TextNote.Create Method
Overload List
Name | Description
Create(Document, ElementId, XYZ, String, ElementId)
 Creates a new unwrapped TextNote element with the given properties.
Create(Document, ElementId, XYZ, String, TextNoteOptions)
 Creates a new unwrapped text note element with the given properties.
Create(Document, ElementId, XYZ, Double, String, ElementId)
 Creates a new line-wrapping text note element of the given width and properties.
Create(Document, ElementId, XYZ, Double, String, TextNoteOptions)
 Creates a new line-wrapping text note element of the given width and properties.
See Also
TextNote Class
TextNote Members
Autodesk.Revit.DB Namespace